{
    "2025-04-29": [
        {
            "title": "White House calls Amazon ‘hostile’ for reported tariff displays",
            "description": "The White House denounced Amazon.com Inc’s reported move to display the cost of  Trump’s tariffs on products. Find out more here",
            "publishedAt": "2025-04-29",
            "source": "Financial Post",
            "url": "https://financialpost.com/news/retail-marketing/e-commerce-solutions/white-house-calls-amazon-hostile"
        },
        {
            "title": "UPS Plans 20,000 Job Cuts This Year After Amazon Pullback",
            "description": "United Parcel Service Inc. expects to cut 20,000 jobs this year and close facilities as it dramatically reduces shipments for e-commerce giant Amazon.com Inc.",
            "publishedAt": "2025-04-29",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/ups-plans-20000-job-cuts-this-year-after-amazon-pullback"
        },
        {
            "title": "Amazon is not planning to show added tariff costs next to its online product listings",
            "description": "NEW YORK (AP) — Amazon is not planning to list added tariff costs next to product prices on its site — despite speculation spanning from a report that claimed the e-commerce giant would soon show new import charges, as well as fiery comments from President Do…",
            "publishedAt": "2025-04-29",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/amazon-is-not-planning-to-show-added-tariff-costs-next-to-its-online-product-listings"
        },
        {
            "title": "Amazon and SunPower Executive Kumar Brahnmath Joins Measurabl as Chief Product & Technology Officer to Accelerate Innovation in Data-Driven Sustainability",
            "description": "Appointment underscores Measurabl’s leadership in scaling innovation and empowering real estate stakeholders with actionable investment-grade sustainability data. SAN DIEGO, April 29, 2025 (GLOBE NEWSWIRE) — Measurabl, the world’s most widely adopted sustaina…",
            "publishedAt": "2025-04-29",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/amazon-and-sunpower-executive-kumar-brahnmath-joins-measurabl-as-chief-product-technology-officer-to-accelerate-innovation-in-data-driven-sustainability"
        },
        {
            "title": "Amazon says it considered breaking out a tariff charge. The White House called it ‘a hostile action’ | CNN Business",
            "description": "The White House took aggressive aim at Amazon, which confirmed Tuesday it was considering displaying the added cost of President Donald Trump’s tariffs on certain items.",
            "publishedAt": "2025-04-29",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/04/29/business/white-house-calls-report-that-amazon-is-adding-a-tariff-charge-a-hostile-action/index.html"
        },
        {
            "title": "White House hits back at Amazon plan to show tariff price rises",
            "description": "US press secretary Karoline Leavitt calls a reported plan to detail tariff impact on prices a \"hostile\" political act.",
            "publishedAt": "2025-04-29",
            "source": "BBC News",
            "url": "https://www.bbc.co.uk/news/articles/cdxg7xpr2j0o"
        },
        {
            "title": "UPS is cutting 20,000 jobs. It’s not what you think | CNN Business",
            "description": "UPS will cut 20,000 jobs this year, about 4% of its global workforce, the company said Tuesday. But UPS added the decision is unrelated to tariffs and is instead due to increased use of technology and a previously announced plan to trim its Amazon business.",
            "publishedAt": "2025-04-29",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/04/29/business/ups-job-cuts/index.html"
        }
    ],
    "2025-05-15": [
        {
            "title": "With rising costs, many turn to Amazon for financial flexibility",
            "description": "This Amazon FBA course bundle lets you explore e-commerce as a flexible, affordable side income in today’s challenging economy.",
            "publishedAt": "2025-05-15",
            "source": "Financial Post",
            "url": "https://financialpost.com/personal-finance/business-essentials/2025-ultimate-amazon-fba-bundle"
        }
    ],
    "2025-05-16": [
        {
            "title": "Amazon, worker union before Quebec labour tribunal over warehouse closures",
            "description": "MONTREAL — A Quebec labour tribunal has begun hearing a case against Amazon over the e-commerce giant’s closure in January of seven warehouses in the province. Some 1,700 employees lost their jobs following Amazon’s sudden termination of its Quebec warehouse …",
            "publishedAt": "2025-05-16",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/amazon-worker-union-before-quebec-labour-tribunal-over-warehouse-closures"
        },
        {
            "title": "Origins Launches in the U.S. Amazon Premium Beauty Store",
            "description": "The brand brings its high-performance, clinically proven, nature-inspired skincare to Amazon shoppers NEW YORK — Origins, with over 30 years of expertise in combining naturally-derived and scientifically crafted ingredients for powerful skincare, announced it…",
            "publishedAt": "2025-05-16",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/origins-launches-in-the-u-s-amazon-premium-beauty-store"
        }
    ],
    "2025-04-28": [
        {
            "title": "Given Trump’s trade war, are Big Tech’s earnings estimates too high?",
            "description": "As Microsoft, Apple, Meta and Amazon prepare to report Q1 results, weaker than expected earnings may cause a further selloff. Find out more",
            "publishedAt": "2025-04-28",
            "source": "Financial Post",
            "url": "https://financialpost.com/investing/trump-trade-war-big-tech-earnings-estimates-too-high"
        },
        {
            "title": "Amazon launches its first internet satellites to compete against SpaceX’s Starlinks",
            "description": "CAPE CANAVERAL, Fla. (AP) — Amazon’s first batch of internet satellites rocketed into orbit Monday, the latest entry in the mega constellation market currently dominated by SpaceX’s thousands of Starlinks. The United Launch Alliance’s Atlas V rocket carried u…",
            "publishedAt": "2025-04-28",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/amazon-launches-its-first-internet-satellites-to-compete-against-spacexs-starlinks"
        }
    ],
    "2025-05-07": [
        {
            "title": "Amazon to Invest More Than $4 Billion to Launch Infrastructure Region in Chile",
            "description": "New AWS South America (Chile) Region will enable customers to run workloads and securely store their content in Chile while serving end users with even lower latency Active customers in Chile include AgroSuper, Andres Bello University, Banco de Chile, Banco I…",
            "publishedAt": "2025-05-07",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/amazon-to-invest-more-than-4-billion-to-launch-infrastructure-region-in-chile"
        }
    ],
    "2025-05-14": [
        {
            "title": "Boomi and AWS Announce Strategic Collaboration to Transform Enterprise AI Integration, Automation, and SAP Cloud Migration",
            "description": "CONSHOHOCKEN, Pa. — Boomi™, the leader in AI-driven automation, today announced a multi-year Strategic Collaboration Agreement (SCA) with Amazon Web Services (AWS) to help customers build, manage, monitor and govern generative artificial intelligence (AI) age…",
            "publishedAt": "2025-05-14",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/boomi-and-aws-announce-strategic-collaboration-to-transform-enterprise-ai-integration-automation-and-sap-cloud-migration"
        }
    ],
    "2025-05-13": [
        {
            "title": "AWS and HUMAIN Announce Groundbreaking AI Zone to Accelerate AI Adoption in Saudi Arabia and Globally",
            "description": "More than $5 billion joint investment in AI infrastructure, AWS services, and AI training and talent development will advance Saudi Arabia’s mission to be a global leader in AI RIYADH, Saudi Arabia — Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. compan…",
            "publishedAt": "2025-05-13",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/aws-and-humain-announce-groundbreaking-ai-zone-to-accelerate-ai-adoption-in-saudi-arabia-and-globally"
        }
    ],
    "2025-05-08": [
        {
            "title": "The construction of a road in Brazil draws criticism before first-ever climate talks in the Amazon",
            "description": "BELEM, Brazil (AP) — In the run-up to the annual U.N. climate conference, set to take place in Brazil’s Amazon in November, the construction of a road is drawing attention, with critics arguing it will lead to environmental degradation. Before the talks, call…",
            "publishedAt": "2025-05-08",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/the-construction-of-a-road-in-brazil-draws-criticism-before-first-ever-climate-talks-in-the-amazon"
        }
    ],
    "2025-05-01": [
        {
            "title": "Adastra Named AWS Data Foundation Partner, Helping Organizations Ready Their Data for Generative AI",
            "description": "TORONTO — Adastra Group (also known as Adastra Corporation), a global leader in data analytics and artificial intelligence, is proud to announce it has become an Amazon Web Services (AWS) Data Foundation partner, based on powering successful generative AI dep…",
            "publishedAt": "2025-05-01",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/adastra-named-aws-data-foundation-partner-helping-organizations-ready-their-data-for-generative-ai"
        }
    ]
}