{
    "2025-05-15": [
        {
            "title": "‘No more India’: Trump pressures Apple to shift iPhone production back to US",
            "description": "Trump added that India has one of the world’s highest tariff barriers but has recently offered to drop tariffs on US goods to improve trade ties.",
            "publishedAt": "2025-05-15",
            "source": "Bloomberg",
            "url": "https://www.bloomberg.com/news/articles/2025-05-15/trump-wants-apple-to-stop-moving-iphone-production-to-india"
        },
        {
            "title": "Trump asks Apple to stop moving iPhone production to India",
            "description": "Donald Trump asked Apple Inc.’s CEO to stop building plants in India to make devices for the U.S., pushing  domestic production. Read on",
            "publishedAt": "2025-05-15",
            "source": "Financial Post",
            "url": "https://financialpost.com/news/trump-asks-apple-stop-moving-iphone-production-to-india"
        },
        {
            "title": "IPhone Supplier TDK Readies Batteries Geared for Thin AI Gadgets",
            "description": "TDK Corp. is readying a new generation of batteries to power smartphones through AI tasks at a time that major client Apple Inc. is also preparing to launch a slimmer handset.",
            "publishedAt": "2025-05-15",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/iphone-supplier-tdk-readies-batteries-geared-for-thin-ai-gadgets"
        },
        {
            "title": "Trump says he has a ‘little problem’ with Tim Cook | CNN Business",
            "description": "President Donald Trump isn’t pleased with Apple CEO Tim Cook’s plan to manufacture iPhones bound for the United States at newly built plants in India.",
            "publishedAt": "2025-05-15",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/05/15/tech/tim-cook-donald-trump-india-problem"
        }
    ],
    "2025-05-07": [
        {
            "title": "Harvest Announces Filing of the Preliminary Prospectus for Harvest Apple Enhanced High Income Shares ETF",
            "description": "OAKVILLE, Ontario — Harvest Portfolios Group Inc. (“Harvest”) is pleased to announce that it has filed a preliminary prospectus with the Canadian securities regulators for the Harvest Apple Enhanced High Income Shares ETF (“APLE”). APLE provides single-stock …",
            "publishedAt": "2025-05-07",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/harvest-announces-filing-of-the-preliminary-prospectus-for-harvest-apple-enhanced-high-income-shares-etf"
        },
        {
            "title": "Apple looks to add AI search to Safari in potential blow for Google | CNN Business",
            "description": "Apple is “actively looking at” reshaping the Safari web browser on its devices to focus on AI-powered search engines, Bloomberg News reported on Wednesday, a move that could chip away at Google’s dominance in the lucrative search market.",
            "publishedAt": "2025-05-07",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/05/07/tech/apple-ai-search-safari-potential-blow-for-google"
        }
    ],
    "2025-05-02": [
        {
            "title": "Apple hit with pair of downgrades as tariff worries grow",
            "description": "Apple received at least two downgrades on Friday, following quarterly results that reinforced concerns over tariffs. Read more.",
            "publishedAt": "2025-05-02",
            "source": "Financial Post",
            "url": "https://financialpost.com/investing/apple-downgrades-tariff-growth-worries"
        },
        {
            "title": "DEI is winning with Costco, Apple and Levi’s shareholders | CNN Business",
            "description": "Diversity, equity and inclusion (DEI) has been losing with corporate America, with one big exception: the people who actually own the companies.",
            "publishedAt": "2025-05-02",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/05/02/business/costco-apple-levi-shareholders-dei"
        },
        {
            "title": "Apple CEO says Trump’s tariffs could cost company $900 million this quarter",
            "description": "Tariffs could add $900 million to Apple’s costs this quarter, Apple CEO Tim Cook said on Thursday, as he revealed the tech giant was shifting production of iPhones sold in the United States from China to India.",
            "publishedAt": "2025-05-02",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/05/02/tech/china-apple-trump-tariffs-tim-cook-intl-hnk"
        }
    ],
    "2025-05-13": [
        {
            "title": "Study finds BILT for Apple Vision Pro accelerates training",
            "description": "Immersive technologies increase learning speed, accuracy and confidence GRAPEVINE, Texas, May 13, 2025 (GLOBE NEWSWIRE) — BILT Incorporated, creators of 3D Intelligent Instructions®, confirms findings of a case study that evaluated the impact of spatial compu…",
            "publishedAt": "2025-05-13",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/study-finds-bilt-for-apple-vision-pro-accelerates-training"
        },
        {
            "title": "Google Unveils Major Android Redesign Ahead of iPhone Overhaul",
            "description": "Google unveiled the biggest update to its Android mobile operating system in years, weeks before its biggest competitor in the space, Apple Inc., is expected to give a preview of its overhauled iPhone software.",
            "publishedAt": "2025-05-13",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/google-unveils-major-android-redesign-ahead-of-iphone-overhaul"
        }
    ],
    "2025-04-28": [
        {
            "title": "Given Trump’s trade war, are Big Tech’s earnings estimates too high?",
            "description": "As Microsoft, Apple, Meta and Amazon prepare to report Q1 results, weaker than expected earnings may cause a further selloff. Find out more",
            "publishedAt": "2025-04-28",
            "source": "Financial Post",
            "url": "https://financialpost.com/investing/trump-trade-war-big-tech-earnings-estimates-too-high"
        }
    ],
    "2025-05-12": [
        {
            "title": "Apple Plans AI-Powered Battery Management Mode for Devices in iOS 19",
            "description": "Apple Inc. is planning to use artificial intelligence technology to address a frequent source of customer frustration: the iPhone’s battery life.",
            "publishedAt": "2025-05-12",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/apple-plans-ai-powered-battery-management-mode-for-devices-in-ios-19"
        },
        {
            "title": "Apple plans AI-powered battery management mode for devices in iOS 19",
            "description": "Apple Inc. is planning to use AI tech to address a frequent source of customer frustration: the iPhone’s battery life. Find out more here",
            "publishedAt": "2025-05-12",
            "source": "Financial Post",
            "url": "https://financialpost.com/technology/tech-news/apple-plans-ai-powered-battery-management"
        }
    ],
    "2025-05-08": [
        {
            "title": "Apple Is Developing Specialized Chips for Glasses, New Macs and AI Servers",
            "description": "Apple Inc.’s silicon design group is working on new chips that will serve as the brains for future devices, including its first smart glasses, more powerful Macs and artificial intelligence servers.",
            "publishedAt": "2025-05-08",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/apple-is-developing-specialized-chips-for-glasses-new-macs-and-ai-servers"
        },
        {
            "title": "From Apple to GM, Tariffs to Cost Companies Tens of Billions",
            "description": "From Apple Inc. to General Motors Co., corporate America is bracing for tens of billions of dollars in damages from Trump’s trade war — and that’s before most affected goods have landed.",
            "publishedAt": "2025-05-08",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/from-apple-to-gm-tariffs-to-cost-companies-tens-of-billions"
        }
    ],
    "2025-05-16": [
        {
            "title": "Fortnite says its now offline on Apple’s iOS around the world",
            "description": "NEW YORK (AP) — Fortnite says it’s now unavailable on Apple’s iOS globally because the tech giant blocked a bid to release the popular video game for iPhone users in the U.S. and Europe. “Apple has blocked our Fortnite submission so we cannot release to the U…",
            "publishedAt": "2025-05-16",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/fortnite-says-its-now-offline-on-apples-ios-around-the-world"
        }
    ],
    "2025-05-14": [
        {
            "title": "CRTC kicks off CanCon hearing as big streamers cancel appearances",
            "description": "OTTAWA — The CRTC launched a hearing about drafting a new definition for Canadian content Wednesday, but three big American streaming companies dropped off the schedule at the last minute. Netflix, Paramount and Apple cancelled their individual appearances, w…",
            "publishedAt": "2025-05-14",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/crtc-kicks-off-cancon-hearing-as-big-streamers-cancel-appearances-2"
        },
        {
            "title": "Apple may owe you money. Here’s how to get it | CNN Business",
            "description": "Have you ever had Siri go off unintentionally? If so, Apple might owe you money.",
            "publishedAt": "2025-05-14",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/05/14/tech/apple-siri-settlement-claim"
        },
        {
            "title": "How Apple could quietly raise iPhone prices this fall without blaming tariffs | CNN Business",
            "description": "If you’re planning to upgrade your iPhone this fall, you may need to prepare to pay more — even if the sticker price doesn’t change.",
            "publishedAt": "2025-05-14",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/05/14/tech/apple-iphone-prices-tariffs"
        }
    ],
    "2025-05-01": [
        {
            "title": "Apple braces for $900m blow from Trump tariffs",
            "description": "The levies will weigh on the iPhone maker, despite Trump's decision to spare key electronics from the new import taxes.",
            "publishedAt": "2025-05-01",
            "source": "BBC News",
            "url": "https://www.bbc.co.uk/news/articles/c86jx18y9e2o"
        },
        {
            "title": "US judge rules Apple violated order to reform App Store | CNN Business",
            "description": "Apple violated a US court order that required the iPhone maker to allow greater competition for app downloads and payment methods in its lucrative App Store and will be referred to federal prosecutors, a federal judge in California ruled on Wednesday.",
            "publishedAt": "2025-05-01",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/04/30/tech/apple-app-store-competition-ruling/index.html"
        }
    ]
}