{
    "2025-05-07": [
        {
            "title": "Goldman Boosts Forecast for US Inflation as Dollar Slides",
            "description": "Economists at Goldman Sachs Group Inc. boosted their forecasts for US inflation this year and next, in part to account for a weaker dollar following the Trump administration’s tariff announcements.",
            "publishedAt": "2025-05-07",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/goldman-boosts-forecast-for-us-inflation-as-dollar-slides"
        }
    ],
    "2025-05-14": [
        {
            "title": "Trump Favors $40-$50 Oil, Goldman Says After Scrutinizing Posts",
            "description": "US President Donald Trump appears to prefer oil prices between $40 and $50 a barrel, according to Goldman Sachs Group Inc., citing an in-house analysis of his social-media posts on the topic.",
            "publishedAt": "2025-05-14",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/trump-favors-40-50-oil-goldman-says-after-scrutinizing-posts"
        },
        {
            "title": "Empower to Offer Private Markets Investments to Retirement Plans",
            "description": "Firm aligns with Apollo, Franklin Templeton, Goldman Sachs, Neuberger Berman, PIMCO, Partners Group and Sagard Nation’s second largest retirement plan provider opens private market investing to its 19 million plan participants1 GREENWOOD VILLAGE, Colo. — In a…",
            "publishedAt": "2025-05-14",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/empower-to-offer-private-markets-investments-to-retirement-plans"
        }
    ],
    "2025-05-13": [
        {
            "title": "‘Bulldog’ Ex-Goldman Banker Answers Carney’s Call to Fix Canada Resources Sector",
            "description": "The first time Timothy Hodgson was asked by Mark Carney to come to Ottawa, he left behind an investment banking career at Goldman Sachs Group Inc. that had seen him climb the ranks to lead its Canadian business.",
            "publishedAt": "2025-05-13",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/bulldog-ex-goldman-banker-answers-carneys-call-to-fix-canada-resources-sector"
        }
    ],
    "2025-05-01": [
        {
            "title": "Constellation Brands to Present at the 2025 Goldman Sachs Global Staples Forum on May 13, 2025",
            "description": "ROCHESTER, N.Y., May 01, 2025 (GLOBE NEWSWIRE) — Constellation Brands, Inc. (NYSE: STZ), a leading beverage alcohol company, announced today that Garth Hankinson, Executive Vice President and Chief Financial Officer, and Jim Sabia, Executive Vice President an…",
            "publishedAt": "2025-05-01",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/constellation-brands-to-present-at-the-2025-goldman-sachs-global-staples-forum-on-may-13-2025"
        }
    ],
    "2025-05-08": [
        {
            "title": "An $80 Billion UAE Firm Is Wooing Trump and Luring Wall Street",
            "description": "Even by Abu Dhabi’s standards, the recent rush of investment bankers is unprecedented. Wall Street giants from Goldman Sachs Group Inc. to Morgan Stanley are courting the hottest new player in town: An $80 billion spinoff from the state oil company that wants…",
            "publishedAt": "2025-05-08",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/an-80-billion-uae-firm-is-wooing-trump-and-luring-wall-street"
        }
    ]
}